# Напишите программу, которая найдёт произведение пар чисел списка. Парой
# считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

def my_print(spisok):
    print([spisok[0+i]*spisok[-1-i] for i in range(int(len(spisok)/2+0.5))])

my_print([2, 3, 4, 5, 6])
my_print([2, 3, 5, 6])
