#3. Напишите программу, в которой пользователь будет задавать две строки,
# а программа - определять количество вхождений одной строки в другой.

s =input('строка: ')
s1 =input('подстрока: ')
print(s.rfind(s1,1))